
//获取到三个选择列表
var shengSelect = document.querySelector(".sheng");
var shiSelect = document.querySelector(".shi");

var shenglist = [
    '河北省', '山西省', '辽宁省', '吉林省', '黑龙江省', '江苏省', '浙江省', '青海省', '台湾省', '内蒙古自治区', '广西壮族自治区', '西藏自治区', '宁夏回族自治区', '新疆维吾尔自治区', '北京市', '天津市', '上海市', '重庆市', '香港特别行政区', '澳门特别行政区', '安徽省', '福建省', '江西省', '山东省', '河南省', '湖北省', '湖南省', '广东省', '海南省', '四川省', '贵州省', '云南省', '陕西省', '甘肃省'
];
var shilist = [
    ['石家庄', '唐山', '秦皇岛', '邯郸', '邢台', '保定', '张家口', '承德', '沧州', '廊坊', '衡水'],
    ['大同', '朔州', '忻州', '阳泉', '吕梁', '晋中', '长治', '晋城', '临汾', '运城'],
    ['沈阳市', '大连市', '鞍山市', '抚顺市', '本bai溪市', '丹东市', '锦州市', '营口市', '阜新市', '辽阳市', '铁岭市', '朝阳市', '盘锦市', '葫芦岛市'],
    ['长春市', '吉林市', '四平市', '通化du市', '白山市', '辽源市', '白城市', '松原市'],
    ['哈尔滨市', '齐齐哈尔市', '牡丹江市', '佳木斯市', '大庆市', '鸡西市', '双鸭山市', '伊春市', '七台河市', '鹤岗市', '黑河市', '绥化市'],
    ['南京市', '无锡市', '徐州市', '常州市', '苏州市', '南通市', '连云港市', '淮安市', '扬州市', '镇江市', '泰州市', '宿迁市'],
    ['舟山市', '杭州市', '嘉兴市', '温州市', '宁波市', '绍兴市', '湖州市', '丽水市', '台州市', '金华市', '衢州市'],
    ['西宁市', '海东市'],
    ['台北市', '新北市', '台中市', '台南市', '高雄市'],
    ['呼和浩特市', '包头市', '乌海市', '赤峰市', '通辽市', '鄂尔多斯市', '呼伦贝尔市', '巴彦淖尔市', '乌兰察布市'],
    ['南宁市', '崇左市', '柳州市', '来宾市', '桂林市', '梧州市', '贺州市', '玉林市', '贵港市', '百色市', '钦州市', '河池市', '北海市', '防城港市'],
    ['拉萨市', '日喀则市', '昌都市', '林芝市', '山南市', '那曲市'],
    ['银川市', '石嘴山市', '吴忠市', '固原市', '中卫市'],
    ['乌鲁木齐市', '克拉玛依市', '吐鲁番市', '哈密市'],
    ['东城', '西城', '朝阳', '丰台', '石景山', '海淀', '门头沟', '房山', '通州', '顺义', '昌平', '大兴', '怀柔', '平谷', '密云', '延庆'],
    ['和平区', '河东区', '河西区', '南开区', '河北区', '红桥区', '滨海新区', '东丽区', '西青区', '津南区', '北辰区', '武清区', '宝坻区', '宁河区', '静海区', '蓟州区'],
    ['黄浦区', '徐汇区', '长宁区', '静安区', '普陀区', '虹口区', '杨浦区', '浦东新区', '闵行区', '宝山区', '嘉定区', '金山区', '松江区', '青浦区', '奉贤区', '崇明区'],
    ['渝中区', '大渡口区', '江北区', '南岸区', '沙坪坝区', '九龙坡区', '北碚区', '渝北区'],
    ['中西区', '湾仔区', '东区', '南区'],
    ['北区', '青州', '台山', '黑沙环', '筷子基'],
    ['合肥市', '芜湖市', '亳州市', '马鞍山', '池州市', '淮南市', '淮北市', '蚌埠市', '巢湖市', '安庆市', '宿州市', '宣城市', '滁州市', '黄山市', '六安市', '阜阳市', '铜陵市'],
    ['福州市', '泉州市', '漳州市', '南平市', '三明市', '龙岩市', '莆田市', '宁德市 '],
    ['南昌市', '赣州市', '景德镇', '九江市', '萍乡市', '新余市', '抚州市', '宜春市', '上饶市', '鹰潭市', '吉安市 '],
    ['潍坊市', '淄博市', '威海市', '枣庄市', '泰安市', '临沂市', '东营市', '济宁市', '烟台市', '菏泽市', '日照市', '德州市', '聊城市', '滨州市', '莱芜市 '],
    ['郑州市', '洛阳市', '焦作市', '商丘市', '信阳市', '新乡市', '安阳市', '开封市', '漯河市', '南阳市', '鹤壁市', '平顶山', '濮阳市', '许昌市', '周口市', '三门峡', '驻马店'],
    ['荆门市', '咸宁市', '襄樊市', '荆州市', '黄石市', '宜昌市', '随州市', '鄂州市', '孝感市', '黄冈市', '十堰市'],
    ['长沙市', '郴州市', '娄底市', '衡阳市', '株洲市', '湘潭市', '岳阳市', '常德市', '邵阳市', '益阳市', '永州市', '张家界', '怀化市 '],
    ['江门市', '佛山市', '汕头市', '湛江市', '韶关市', '中山市', '珠海市', '茂名市', '肇庆市', '阳江市', '惠州市', '潮州市', '揭阳市', '清远市', '河源市', '东莞市', '汕尾市', '云浮市 '],
    ['海口市', '三亚市', '三沙市', '儋州市'],
    ['成都市', '广元市', '巴中市', '绵阳市', '德阳市', '达州市', '南充市', '遂宁市', '广安市', '资阳市', '眉山市', '雅安市', '内江市', '乐山市', '自贡市', '泸州市', '宜宾市', '攀枝花市'],
    ['贵阳市', '遵义市', '六盘水市', '安顺市', '铜仁市', '毕节市'],
    ['昆明市', '昭通市', '丽江市', '曲靖市', '保山市', '玉溪市', '临沧市', '普洱市'],
    ['西安市', '榆林市', '延安市', '铜川市', '渭南市', '宝鸡市', '咸阳市', '商洛市', '汉中市', '安康市'],
    ['兰州市', '嘉峪关市', '酒泉市', '张掖市', '金昌市', '武威市', '白银市', '庆阳市', '平凉市', '定西市', '天水市', '陇南市']
];

//选择省的下标
var shengIndex = 0;
//加载省
for (var i = 0; i < shenglist.length; i++) {
    var shengOption = new Option(shenglist[i]);
    shengSelect.options.add(shengOption);
}
//选择省后加载市
shengSelect.onchange = function (eve) {
    shengIndex = eve.target.selectedIndex - 1;
    if (shengIndex == -1) {
        shiSelect.options.length = 0;

    } else {
        shiSelect.options.length = 0;

        for (var j = 0; j < shilist.length; j++) {
            var shiOption = new Option(shilist[shengIndex][j]);
            shiSelect.options.add(shiOption);
        }
    }
}　　　　　//选择市后加载区
shiSelect.onchange = function (eve) {
    var shiIndex = eve.target.selectedIndex;
}